Tekla Open API Reference for Tekla Structures 2025
Operation.ObjectMatchesToFilter Method
Overload List
Name | Description
ObjectMatchesToFilter(ModelObject, String)
 Checks whether the object matches to the criteria in the given filter.
ObjectMatchesToFilter(ModelObject, FilterExpression)
 Checks whether the object matches to the criteria in the given filter.
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace